{
  "text": "<article> <header> <h2>Terms and Conditions</h2> </header> The product supplied by BensBingo is gaming entertainment for the value of money. The costs for this service is based upon purchases made by confirmation per game and/or pre-purchases. No other fees apply and it is free to join BensBingo. <br /> <br /> The Terms And Conditions below are between you, below Customer, and the provider, below BensBingo for the overall usage as well as compliance of conditions, regulations, and instructions where such are expressed (e.g. rules explained for games, competitions, etc.). BensBingo holds an international gaming license in Curaçao and is owned and operated by Innovus N.V, Johan van Walbeeckplein 24, Curaçao. Payments are contracted and carried out by: BPMNG Solutions LTD, 205349100, 68 Lyuben Karavelov Str., 1142 Sofia, Bulgaria, and Technical Consulting and Management Services Ltd, Station House Connaught Road, Brookwood, Woking, GU24 0ER Surrey United Kingdom. SSL encryption is employed to protect sensitive data. <br /> <br /> BensBingo strive to offer enjoyable, fair, and secure entertainment for all customers. It is therefore important that the Customer respect and comply with the Terms And Conditions below. Governing law for Terms And Conditions, presented in various translations at BensBingo is United Kingdom. Should any question arise to what the Terms And Conditions state the English version should be the base for interpretation of Terms And Conditions. Where interpretation is possible for the text herein the spirit of the text will be applicable. <br /> <br /> Customer support is available at +44 20 7193 1099.</article><article> <header> <h2>1. Integrity Policy</h2> </header> No personal data of the Customer may be sold or transferred to a third party without Customers acceptance and may only be used within the company group of BensBingo (e.g. a parent company, a subsidiary of parent company, etc.). All rights or obligations may be transferred within the group without notice. <p></p> <h3>1.1 Personal Data</h3> <ol> <li>Personal information stated (and/or later altered) at registration</li> <li> IP-Addresses (your unique computer address) at <ol type='a'> <li>Registration</li> <li>Payments</li> <li>Site access and site interaction</li> </ol> <ol> <li>Monetary Transactions at, to, and from BensBingo</li> <li>Communications at, and with BensBingo</li> <li>Gaming activity (game logs)</li> <li> Upon request from BensBingo provide proof of identity by means needed. E.g. a copy of a passport or an internationally accepted identity card. </li> </ol> </li> </ol> <h3>1.2 Security</h3> <ol> <li> BensBingo will ensure that Customer's data is handled in a secure manner and not be negligent </li> <li> BensBingo will not save data so Customers financial security is at risk <ol type='a'> <li> For example, BensBingo will not save Customers card number's CVS code </li> <li> Customer's data will during merchant handling be carried out in a secure manner using the https protocol. </li> </ol> </li> </ol></article><article> <header> <h2>2. General Conditions</h2> </header> <h3> 1 The Customer by registering accepts the Terms And Conditions stated herein. Further the Customer must: </h3> <ol> <li> The Customer by registering accepts the Terms And Conditions stated herein. Further the Customer must: <ol> <li>Comply fully with the Terms And Conditions of BensBingo</li> <li> Not be fraudulent <ol type='a'> <li>Towards governing laws for the Terms And Agreement</li> <li>The Customers domiciles governing laws</li> <li>International laws</li> </ol> </li> <li> Be 18 (eighteen) years of age or older and not under a guardian control </li> <li> Accept and follow legislation in your country where you reside in general and pay special attention to your country's gaming laws </li> <li>Not have or had a gaming addiction</li> <li> Only open one (1) account/membership at BensBingo. Non-compliance will lead to immediate termination of the account/membership plus BensBingo may deduct funds or request compensation for signup bonuses or other cost that customer may have inflicted to BensBingo, (fraudulent behaviour by Customer). </li> <li> Accept And Comply A Termination Of An Account <ol type='a'> <li> After an account has been terminated Customer may not open a new account without the permission from BensBingo. </li> <li> BensBingo do not need to give notice of termination of an account. </li> <li> BensBingo have the right to withhold funds if fraudulent behaviour is suspected by BensBingo or third party during a investigation. </li> </ol> </li> <li> Customer may at any time choose to terminate account/membership at BensBingo and request withdrawal of funds held at BensBingo. Funds may be withheld by BensBingo if illegal or fraudulent behaviour if so suspected as per 2.5 and 2.6.c. </li> <li> Understand how probability gaming work and/or accept BensBingo's interpretation. <ol type='a'> <li> Probability is described according to Wikipedia as 'The likelihood or chance that something is the case or that an event will occur'. Probability gaming differs from skill-based games such as sports betting. Statistical tactic for probability gaming can of course be applied. However, the foundation of games at, unless so announced/described at BensBingo are based upon probability using a Random Number Generator (RNG) that take no 'soft' variables or skill into account but rather base numbers, games purchased, the spread of numbers, spread of games, on a mathematical level and skill from the user do not apply for the outcome part from as above mentioned statistical tactic. Probability is based upon statistics and patterns to statistics can be used with various outcome. I.e. all output from the Random Number Generator is at any time based upon a mathematical probability. </li> <li> The settings for gaming return (winnings/customer return) is set via numerical data which the system via the Random Number Generator will over a period of time converge towards. This is best explained as comparing the flipping of a coin. Head and Tails have the same probability/likeliness of appearing for each flip. During a lower series of flips there is a greater possibility of not getting an equal number of Heads as Tails. The probability of getting an equal number of heads as Tails increase with the number of flips. In gaming using probability and Random Number Generators payback (winnings/customer return) where e.g. a payback of 80% will be converged towards the more times a game has run, just as with the flipping of a coin as described above. </li> <li> Customer understand that probability is random and that Customer may: <ol type='i'> <li>not win at all</li> <li>win less than BensBingo the probability is set to</li> </ol> </li> <li> Customer play at BensBingo at Customer's own risk for all considerable aspects </li> </ol> </li> </ol> <h3>2 Interpreting Game Wins</h3> BensBingo use a certified Random Number Generator and will hence be able to payout the percentage stated per game in a fair and an unbiased manner. BensBingo reserve the right to reclaim inaccurate winnings due to inaccurate settings in BensBingo's system due to human error or/and force majeure. Should a Customer's computer indicate a game win but not BensBingo's system the data at BensBingo system will be used and full disclosure of BensBingo's systems results shall be presented to Customer. <br /><br /> BensBingo's system will interact with number of computers and BensBingo cannot guarantee that all computers present the data BensBingo generated by BensBingo's server correctly. For example a client computer may lose Internet connectivity and contact with BensBingo and present data inaccurately. </li> </ol></article><article> <header> <h2>3. Customer Security and Responsibilities</h2> </header> <ol> <li> BensBingo will at all time take steps to ensure the privacy, security and confidentiality of data about Customer. </li> <li> BensBingo will collect data via cookies (information from Customer's browser) to analyse Customer's site usage in order to improve BensBingo. Such information is strictly used internally. </li> <li> The Customer must keep username and password for accessing BensBingo in a secure manner from third parties. BensBingo cannot be held responsible for access of Customers' account by a third person and/or any damage or loss that might be inflict on Customer and Customer's account. I.e. please make sure that you do not save passwords, usernames, etc. and BensBingo recommend that Customer use firewalls, secure the computer with password, use anti-virus and anti-spyware program and keep them up to date. </li> <li> BensBingo will upon closing of Customer's account (initiated either by Customer or BensBingo) pay out the money, if applicable to Terms and Conditions, to the source of payment carried out by Customer, if transaction origin exist, and Customer may not dictate that other accounts, credit cards, etc. should be used. Further, BensBingo may withhold funds if the account has been closed due to an investigation of any sort of fraudulent behaviour. Funds, parts of funds, funds plus punitive funds in access of funds may be confiscated and/or requested if a fraudulent investigation would require so. </li> <li> Any complaint Customer might have must be sent to complaints@innovusnv.com and to the service provider at complaints@innovusnv.com. We kindly ask you to request a receipt of delivery for your security and knowledge that your email has been received. </li> <li> Customer accept that BensBingo send newsletters and maintain other contact about the site and news related to BensBingo. </li> </ol></article><article> <header> <h2>4. AML - Anti-Money Laundry</h2> </header> Anti-money laundry is important for all online operations involving money flowing back and forth. BensBingo therefor have tools and staff that analyse all transactions. At any suspicion accounts and funds can be frozen pending an internal and/or external investigation. Record keeping of IP addresses, and KYC are part of BensBingo's AML routines. Customers acknowledge their obligation to comply with requests of verification of identity (passport, drivers license, bank references, etc). Frequent and/or larger transactions are always subject to verification of Customer's identity. Customer is not allowed to 'harbour funds' (save larger amounts of money on their accounts. Payouts or withdrawals of winnings must go back to source of deposits and if not possible a full verification of Customer's identity and accounts must be undertaken to ensure funds flow back to the original depositor.</article><article> <header> <h2>5. KYC Policy</h2> </header> BensBingo reserve the right, at any time, to ask for any KYC documentation to determine the identity and location of a user. KYC documentation will be requested upon withdrawal or when deposits reach 2000 EUR. BensBingo reserve the right to restrict the service, payment or withdrawal until identity is sufficiently determined, or for any other reason in our sole discretion basing on the legal framework. The verification is processed within two business days from the date documents are sent. <ol> What's requested: <li>A copy of ID card – Passport or driver's license.</li> <li> Proof of address (POA) - a copy of a recent utility bill, Bank Statement, rental agreement, or any government-issued document matching the recorded address on the User's account. (The documentation can't be older than 3 months.) </li> <li> A copy front and back of all credit cards used to make a deposit (or a screenshot of your Skrill / Neteller / Ezeewallet account or another alternative deposit method). Front of card: Showing only the first 6 and the last 4 digits of the card. Back of card: hiding the security code/CVV. Card must be signed. </li> </ol> <ol> Guideline for the “KYC Process” <li>Proof of ID needs to match the users’s profile.</li> <li>Photo and signature needs to be clearly visible.</li> <li>Full Name and date of birth need to match users’s profile.</li> <li>Documents does not expire in the next 3 months.</li> <li>User needs to be over 18 years of age.</li> <li>Proof of Address (POA.)</li> <li> Bank Statement, utility bill, rental agreement, or any government-issued document. </li> </ol> Once all proper documents are in our possession then the account gets approved. Under no circumstances may a user transfer funds directly to another user.</article><article> <h2> 6. Fees, Payment Options, Transaction Costs, Withdrawal and Refund Policy </h2> <h3>1. Fees</h3> There are no fees to be registered with BensBingo. <h3>2. Payment Options</h3> There are several secure payment methods on BensBingo so that you can find a suitable secure options to your liking. <ol> <li> Cards such as Visa and Mastercards are available as well as local options where applicable. Deposits are credited directly to your account. Withdrawals take roughly 2-7 bank days including internal reviews. </li> <li> Bank transfers are mostly credited directly and withdrawals are also direct. Review routines apply and you should have your money within 24 hours. </li> <li> Moneybookers and Skrill, e-wallets, are credited directly and withdrawals are also direct. Review routines apply and you should have your money within 24 hours. </li> </ol> <h3>3. Transaction Costs</h3> <ol> <li> BensBingo has the right to add transaction fees for deposits and withdraws. Any such fees are expressed in the process if/where applicable and should be viewed as an equitable way to allow Customer to bear Customers' costs. As all transactions are adherent with merchant costs as a percentage or/and a fixed sum, a customer that carry out many transactions would add greater overall costs for BensBingo that would otherwise have to be divided amongst other customers at BensBingo. All fees are displayed in advance. </li> <li> No interest is awarded to the Customer for any funds held BensBingo. </li> </ol> <h3>4. Withdrawal Rules</h3> <ol> <li> €5000 is the maximum amount that can be withdrawn in total per month from large winnings on casino games/slots at the discretion of the operator. </li> <li>Only winnings after a deposit can be withdrawn.</li> <li> Winnings from bonuses and free spins without deposits are limited to max 100 EUR. </li> <li> Upon a withdrawal all bonus money will be deducted from Customer's account. </li> <li> A wagering requirement of 40 (forty) unless otherwise stated, is applicable to bonus money, free spins/money given upon registration and/or other instances. For enabling withdrawals of winnings thereof a bonus of e.g. 100 (given at registration or other) must be turned over (wagered) to the value of 4,000. Wagering requirements may vary depending on promotion and will be found in terms and conditions associated with the promotion. Only wagering with bonus money will count towards meeting the wagering requirements. The maximum bet allowed when using a bonus (until wagering requirements are met) is 5 Euro per bet. Failure to follow this may forfeit any winnings. The contribution level per game type towards meeting wagering requirements are: <ol type='a'> <li>100% Slots/Video Slots</li> <li>100% Scratch</li> <li> 0% Other table games like Oasis Poker, Pontoon, Punto Banco and Caribbean Poker </li> <li>0% Video Poker (all types)</li> <li>0% Blackjack (all types)</li> <li>0% Roulette (all types)</li> <li>0% Baccarat (all types)</li> </ol> </li> </ol> <h3>5. Bonus Abuse</h3> <ol> <li> Bonus Abuse includes, but is not limited to <ol type='a'> <li> breach of terms and conditions of a bonus, free bets or any other promotional offer; </li> <li>the opening of multiple accounts to claim multiple bonuses;</li> </ol> </li> <li> Where there is a reasonable suspicion that the Account Holder has committed or attempted to commit a bonus abuse, either on their own or as part of a group, BensBingo reserves the right to: <ol type='a'> <li> forfeit the bonus allocated to the Account Holder and any winnings from that bonus, and/or </li> <li> revoke, deny, or withdraw a bonus offer from the Account Holder, and/or </li> <li>block an access to particular products, and/or</li> <li> exclude the Account Holder from any future promotional offers, and/or terminate the Account Holder's account with immediate effect. </li> </ol> </li> </ol> <h3>6. Refund Policy</h3> <ol> <li> Customer accept and understand that money wagered (spent) cannot be under no circumstance be refundable. </li> <li> Funds on an account that has been deposited and/or are result of winnings and not used and/or partially used can be withdrawn at any time. Terms and Conditions apply. </li> <li>Transaction costs may be applied, please see above.</li> <li> If Customer or BensBingo cancel a requested withdrawal all funds, real money and bonus money, will be returned to the Customers account and applicable to Terms and Conditions as prior to the cancelation. Should a Customer request a chargeback transaction costs and fees associated with chargebacks are applied to the Customers account. </li> <li> Refunds or payouts of winnings are limited to one free transaction per week across the network. If extra transactions are needed and accepted a fee of EUR 5 may be applied. </li> </ol></article><article> <header> <h2>7. Complaints</h2> </header> If you're experiencing any issues with regards to your payments, bonuses, responsible gaming limits, etc feel free to&nbsp;contact our support team at any time at complaints@innovusnv.com. We will do our utmost to resolve any issues you might have as soon as possible. Complaints are handled in the support department and escalated in the organisation of BensBingo in the case that customer support did not solve the case immediately. BensBingo is to acknowledge a complaint started by the account holder only. It is forbidden to and you can therefore not assign, transfer, hand over or sell your complaint to the third party. BensBingo will dismiss the complaint if the matter is handed over to be conducted by the third party and not the original account owner. In the event of any dispute, you agree that the server logs and records shall act as the final authority in determining the outcome of any claim. You agree that in the unlikely event of a disagreement between the result that appears on your screen and the game server, the result that was logged on the game server will prevail, and you acknowledge and agree that our records will be the final authority in determining the terms and circumstances of your participation in the relevant online gaming activity and the results of this participation. When we wish to contact you regarding such a dispute, we will do so by using any of the contact details provided in your Player Account.</article><article> <header> <h2>8. Change of Terms and Conditions</h2> </header> BensBingo reserve the right to change Terms And Conditions without notice. Please bookmark this page for future reference.</article><article> <header> <h2>8. License</h2> </header> BensBingo™ is owned and/or operated by Innovus N.V. Group of companies 68 Lyuben Karavelov Str., 1142 Sofia, Bulgaria. The Innovus N.V. Group includes/consists of BPMNG Solutions LTD, 205349100, 68 Lyuben Karavelov Str., 1142 Sofia, Bulgaria, Technical Consulting and Management Services Ltd, Station House Connaught Road, Brookwood, Woking, GU24 0ER Surrey, and Innovus N.V. Johan van Walbeeckplein 24, Curaçao <br />SSL encryption is employed to protect sensitive data.</article>"
}
